# 区别
"""
数据结构    是否可变    是否重复    是否有序(有下标,多次遍历顺序一致)    如何定义
列表         是         是          是                       []或list()
元组         否         是          是                       ()或tuple()
字典         是        key不允许     否                       {}或dict()
集合         是         否          否                       {}或set()
字符串       否         是          是
"""
# 可变: 创建后,可以原地修改内部元素,内存地址不变;
# 不可变: 一旦创建,不能修改里面的内容(除非可变类型元素),想要改只能创建新对象
# 可变:指的是对象中的元素可变,元素变后,该对象的地址不会变;比如list=[1,2],list[0]=3,id(list)不会变
# 不可变:对象中的元素不可变,变了后,直接就是新对象(tuple新增/删除元素都是另一个tuple,除非修改的是元组中的可变元素(list))
# 可变与不可变侧重点是值是否可变,只要对象重新赋值,id(对象)都会变

list_test = [1,2,3,4,set([4,5,6])]
print(id(list_test))
list_test[0] = 8
list_test.append(7)
print(id(list_test)) # id不变

# 可变: list、dict、set
# 不可变：tuple、str